{
  "header": "Musicians",
  "intro": "I wish to express my respect to the wonderful people, who made the CD \"Solos and Duos\" possible! They put an enormous amount of time and dedication into my pieces to bring the to life!",
  "body": {
    "text01": "<h2 class='u-h4'>Misha Dacic</h2><p>He was born in former Yugoslavia in 1978 and first came to public attention at the age of eleven when performing a Haydn piano concerto. He studied with Kemal Gekic at the University of Novi Sad and Lazar and Valentina Berman in Imola, Italy. He made his America debut at the Discovery Series of the Sixth Miami International Piano Festival in 2003. During this year he also performed at the Martha Argerich Project Festival in Lugano, Switzerland, at the Miami International Piano Festival in Lecce, Italy, and at the University of Miami's Festival Miami.</p><p>Among other performances were those at the Rising Stars Series in Ravinia (Chicago), at the Gilmore Festival in Kalamazoo, at the Xavier Piano series in Cincinnati, at Irvine Valley College (California), at the Golandsky Institute International Piano Festival at Princeton University and at the Terni Cultural Institute in New York. Misha Dacic is a recipiant of support from Patrons of Exceptional Artists and enjoys a special scholarship at the University of Miami Frost School of Music where he pursues piano studies with Frank Cooper.</p>",
    "text02": "<h2 class='u-h4'>Craig Hultgren</h2><p>Cellist Craig Hultgren is an activist for new music, the newly creative arts, and the avant-garde. Possessing a broad range of instrumental techniques, from traditional to radical, Hultgren presents his own spontaneous, free-style improvosations along with programs of new music throughout the country and abroad. A recipient of Artist Fellowships in 1992 and 1999 from the Alabama State Council on the Arts, he has been a member since 1993 of Thåmyris, a contemporary chamber music ensemble in Atlanta. A long-time member of the Alabama Symphony, he also plays in the Chagall Trio and the newly formed Luna Nova ensemble of the Associated Colleges of the South. Hulgren also works in the behalf of arts as an organizer. He has served as president of both the Birmingham Art Music Alliance and the Birmingham Art Association, where he instituted Birmingham Improv, an international festival of improvisation. Nationally, he is a consultant for the Living Music Foundation and on the Steering Committee of the New Directions Cello Association.</p>",
    "text03": "<h2 class='u-h4'>Scott Deal</h2><p>An active performer of new music, Scott Deal has performed at venues in London, Boston, Washington, DC, Moscow, Russia, as well as throughout the United States. He has performed at the Sub Tropics New Music Festival, May in Miami, SEAMUS International Electronic Music Conference, and several Percussive Arts Society International Conventions. Continually inspired by new and emerging artistic technologies, he is a founding member of ART GRID, an internet-based telematic performing collective. In this capacity he has performed at Supercomputing Global, SIGGRAPH and with groups that include Another Language and the Helsinki Institute Computer Orchestra. He holds a Doctor of Musical Arts Degree from the University of Miami, a Master of Music degree from the University of Cincinnati College-Conservatory of Music and a Bachelor of Arts degree from Cameron University.</p>",
    "text04": "<h2 class='u-h4'>Henry Skolnick</h2><p>Henry Skolnick is internationally acclaimed as one of few active soloists on the contrabassoon. Composers from the USA, England, the Netherlands, Italy and Germany have written works for him. He was a member of the Florida Philharmonic Orchestra in Miami for seventeen years. During that time he was instructor of bassoon at Florida International University in Miami. Mr. Skolnick is a frequently featured soloist at the annual conferences of the International Double Reed Society, appearing in such cities as Manchester, England, Rotterdam, The Netherlands and Melbourne, Australia. He has performed with many orchestras including the Miami Chamber Symphony, the Florida Grand Opera Orchestra, the Symphony Orchester Berlin, Sinfonia da Camera, the Kansas City Symphony and the Colorado Symphony. In the summer he teaches at the Interlochen Arts Camp in Interlochen, Michigan. He has previously participated in recordings for Harmonia Mundi, Naxos and Innova.</p>",
    "text05": "<h2 class='u-h4'>José Lopez</h2><p>José Lopez is currently (2006) Visiting Professor and Coordinator of Keyboard Studies at Florida International University in Miami, Florida, and has been on the piano faculty since 1997. He has performed throughout the United States, Italy and Central and South America with orchestras, in solo recitals, and with chamber groups. A versatile pianist and an enthusiastic performer of chamber music, he was a founding member of the Dalbergi Trio, is a member of Florida International University's resident new music ensemble Nodus, the collaborative ArtSouth Ensemble, and was the orchestral pianist with the Florida Philharmonic for 14 years. He is a graduate of the University of Miami School of Music, where he studied with Dr. Rosalina Sackstein, a former pupil of Claudio Arrau. He has recorded previously for SNE and Innova record labels.</p>",
    "text06": "<h2 class='u-h4'>Glenn Basham</h2><p>Glenn Basham, Associate Professor (Violin) at the University of Miami Frost School of Music, is a graduate of the North Carolina School of the Arts, where he received his B.A. degree, and the Indiana University School of Music, where he received his M.M. degree. He has served as concertmaster of the Grand Teton Music Festival in Wyoming, the Hot Springs Music Festival, the Fort Wayne Philharmonic and the Pine Mountain Music Festival. He was the artistic director of the Northeast Indiana Chamber Music Festival and he has previously played with the Detroit Symphony under Antal Dorati. He has recorded classical and jazz CDs with various musicians in South Florida and is presently a member of the artist faculty at the University of Miami Frost School of Music. Basham has been a featured soloist frequently with the Naples Philharmonic Orchestra, performing concertos by Brahms, Beethoven, Tchaikovsky and Stravinsky. He joined the Naples Philharmonic Orchestra as concertmaster in 1994.</p>",
    "text07": "<h2 class='u-h4'>John J. Olah</h2><p>John J. Olah, Jr., Associate Professor (Tuba) and Program Director, Brass, at the University of Miami Frost School of Music received a B.M. degree from the Baldwin Wallace College Conservatory, an M.M degree from the University of New Mexico, and has pursued advanced studies at the Cleveland Institute of Music. A student of Ronald Bishop, Olah has performed with the New Mexico Symphony Orchestra, the Cleveland Ballet Orchestra, the Ohio Chamber Orchestra, the Santa Fe Chamber Orchestra, the New Mexico Brass Quintet, the Cleveland Brass Quintet, the Cleveland Brass Consort, and the Blossom Festival Band. He has recorded previously with the Cleveland Orchestra and the Cleveland Symphonic Winds.</p>",
    "text08": "<h2 class='u-h4'>Joseph Evans</h2><p>Joseph Evans has appeared as leading tenor at La Scala, Ireland's Wexford Festival, the New Israeli Opera, English National Opera, Welsh National Opera, Opera de Nantes, Orleans, La Fenice in Venice, and Switzerland's Grand Théatre de Genéve. He was leading tenor during eight seasons at the New York City Opera. More recently, he has sung the role of Captain Vere in the Tel Aviv, Seattle, and Houston productions of Billy Budd; Curley in Of Mice and Men for Washington, Houston and Bregenz, Austria; Herod in Austin Lyric's Salome; and the title role in Tokyo's Peter Grimes. At HGO he has also appeared in Eugene Onegin, The Makropuöos Affair, and the world premieres of Jake Heggie's The End of the Affair and Daniel Catan's Salspuedes. Previous recordings include Carlisle Floyd's Of Mice and Men and Cold Sassy Tree, I Capuletti e i Montecchi with Beverly Sills; Beethoven's Fidelio with Jon Vickers and Teresa Kubiak; Berlioz's Benvenuto Cellini, Le Rapt de Perséphone by Andre Bon, and The Unholy Sonnets of John Donne by Samuel Adler. He is Professor of Voice at the University of Houston Moores School of Music.</p>",
    "text09": "<h2 class='u-h4'>Ross Harbaugh</h2><p>Ross Harbaugh, Professor (Violoncello) at the University of Miami Frost School of Music, cellist with the Bergonzi String Quartet and is a regular recitalist and lecturer around the United States. He studied with Janos Starker, Leonard Rose, Andre Navarra, and Peter Howard. He earned B.A. and B.M. degrees from Bowling Green University, with post graduate studies at Indiana University and the Paris Conservatory. He studied chamber music with Robert Mann of the Juilliard Quartet and Eugene Lehner in Boston. Harbaugh won the Naumburg Chamber Music Prize and a Prix du Disque with the New World Quartet, and has performed in Alice Tully Hall, Lincoln Center, Kennedy Center and London's Wigmore Hall. He has appeared as soloist with many orchestras, including the Atlanta, Cincinnati, Miami Chamber and Canadian Chamber Orchestras, and was principal cellist of the Grand Rapids and Toledo Symphonies. He has previously recorded for VOX, CRI, Musical Heritage, MCA Classics, Centaurg Fleur de Son, and IMP Masters. He performs on a cello made by Domenico Montagnana.</p>"
  }
}